//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*! \page page6 Структура меню

    \tableofcontents

    \section section01 ДИСПЛЕЙ

    \section section02 КАНАЛ 1

    \section section03 КАНАЛ 2

    \section section04 СИНХР

    \section section05 РАЗВ

    \section section06 ФУНКЦИЯ

    \code

    |   ФУНКЦИЯ   |
    +------+------+
           |
           +------| ОСЦИЛЛОГРАФ |
           |      +------+------+
           |             |
           |             +-------|   СПЕКТР    |
           |             |       +------+------+
           |             |              |
           |             |              +------ Отображение ... | Откл        | Вкл      |
           |             |              |
           |             |              +------ Шкала ......... | Логарифм    | Линейная |
           |             |              |
           |             |              +------ Источник ...... | Канал 1 + 2 | Канал 1  | Канал 2 |
           |             |              |
           |             |              +------ Окно .......... | Хэмминга    | Блэкмена | Ханна   | Прямоугольн |
           |             |              |
           |             |              +------|   КУРСОРЫ   |
           |             |                     +------+------+
           |             |       
           |             |       
           |             +-------| ЧАСТОТОМЕР  |
           |             |       +------+------+
           |             |              |
           |             |              +------ Отображение ..... | Откл    | Вкл   |
           |             |              |
           |             |              +------ Время счёта ..... | 100 мс  | 1 c   | 10  c  |
           |             |              |
           |             |              +------ Метки времени ... | 100 кГц | 1 МГц | 10 МГц | 100 МГц |
           |             |              |
           |             |              +------ Кол периодов .... | 1       | 10    | 100    |
           |             |
           |             |
           |             +-------| МАТЕМАТИКА  |
           |                     +------+------+
           |                     
           |      
           +------|  TЕСТЕР-К   |
           |      +------+------+
           |             |
           |             +------- Управление .... | Напряжение | Ток    |
           |             |
           |             +------- Шаг ........... | 100 мВ     | 500 мВ | *** Управление - Напряжение ***
           |             |                        | 4 мА       | 20 ма  | *** Управление - Ток        ***
           |             |
           |             +------- Полярность .... | +          | -      |
           |             |
           |             +------- Отображение ... | Линии      | Точки  |
           |             |
           |             +------- Сглаживание ... | 1          | 2      | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
           |
           |      
           +------| МУЛЬТИМЕТР  |
           |      +------+------+
           |             |
           |             +------- Режим .... | U=    | U~     | I=      | I~     | R | VD | BELL |
           |             |
           |             +------- Предел ... | 2 В   | 50 В   | 500 В   |          *** Режим - U=   ***
           |             |                   | 2 В   | 40 В   | 400 В   |          *** Режим - U~   ***
           |             |                   | 2 кОм | 20 кОм | 200 кОм | 10 МОм | *** Режим - R    ***
           |             |                   --- запрещено ---                     *** Режим - VD   ***
           |             |                   --- запрещено ---                     *** Режим - BELL ***
           |             |
           |             +------- АВП ...... | Откл  | Вкл    |
           |      
           |      
           +------| РЕГИСТРАТОР |
                  +------+------+
                 

    \endcode

    \section section07 ИЗМЕР

    \section section08 ПАМЯТЬ

    \section section09 СЕРВИС

*/
