#include "Keyboard.h"


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Key Keyboard::WaitPressingButton()
{
    return Key::None;
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
void Keyboard::Enable()
{
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
void Keyboard::Disable()
{
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
bool Keyboard::IsFunctionalButton(Key button)
{
    return button.code >= Key::F1 && button.code <= Key::F5;
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
pString Key::Name()
{
    static const pString names[Key::NumButtons] =
    {
        "None",
        "Функция",
        "Измер",
        "Память",
        "Сервис",
        "Канал 1",
        "Канал 2",
        "Развертка",
        "Пуск/стоп",
        "Синхр",
        "Дисплей",
        "Range 1 больше",
        "Range 1 меньше",
        "RShift 1 больше",
        "RShift 1 меньше",
        "Range 2 больше",
        "Range 2 меньше",
        "RShift 2 больше",
        "RShift 2 меньше",
        "TBase больше",
        "TBase меньше",
        "TShift больше",
        "TShift меньше",
        "Синхр больше",
        "Синхр меньше",
        "Влево",
        "Вправо",
        "Вверх",
        "Вниз",
        "Ввод",
        "1",
        "2",
        "3",
        "4",
        "5"
    };

    return names[code];
}

//----------------------------------------------------------------------------------------------------------------------------------------------------
pString TypePress::ToString()
{
    static const pString names[4] =
    {
        "Вниз",
        "Повтор",
        "Вверх",
        "Пусто"
    };

    return names[type];
}
