#pragma once


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#define REG_SET_ACTIVE_ON_CURSORS IsRegSetActiveOnCursors()


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/// Возвращает true, если вращение ручки УСТАНОВКА будет перемещать курсоры/курсоры
bool IsRegSetActiveOnCursors();
/// Вызываем эту функцию для каждого измерения, чтобы обновить положие курсоров, если они должны обновляться автоматически.
void UpdateCursorsForLook();


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
class PageMeasures
{
public:
    static const PageBase *pointer;

    static const PageBase *GetPageFrequencyCounter();

    //------------------------------------------------------------------------------------------------------------------------------------------------
    class PageTune
    {
    public:
        static const PageBase *pointer;
    };

    //------------------------------------------------------------------------------------------------------------------------------------------------
    class PageCursors
    {
    public:
        static const PageBase *pointer;
    };
};
